Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.3.152/CA90/include/pio/pic32cz2051ca90100.h
#define PIN_PC14A_EIC_EXTINT14                     _UINT32_(78)
#define MUX_PC14A_EIC_EXTINT14                     _UINT32_(0) 
#define PINMUX_PC14A_EIC_EXTINT14                  ((PIN_PC14A_EIC_EXTINT14 << 16) | MUX_PC14A_EIC_EXTINT14)
#define PORT_PC14A_EIC_EXTINT14                    (_UINT32_(1) << 14)
#define PIN_PC14A_EIC_EXTINT_NUM                   _UINT32_(14) /* EIC signal: PIN_PC14 External Interrupt Line */

#define PIN_PA15A_EIC_EXTINT15                     _UINT32_(15)
#define MUX_PA15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PA15A_EIC_EXTINT15                  ((PIN_PA15A_EIC_EXTINT15 << 16) | MUX_PA15A_EIC_EXTINT15)
#define PORT_PA15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PA15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PA15 External Interrupt Line */

#define PIN_PB15A_EIC_EXTINT15                     _UINT32_(47)
#define MUX_PB15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PB15A_EIC_EXTINT15                  ((PIN_PB15A_EIC_EXTINT15 << 16) | MUX_PB15A_EIC_EXTINT15)
#define PORT_PB15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PB15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PB15 External Interrupt Line */

#define PIN_PC15A_EIC_EXTINT15                     _UINT32_(79)
#define MUX_PC15A_EIC_EXTINT15                     _UINT32_(0) 
#define PINMUX_PC15A_EIC_EXTINT15                  ((PIN_PC15A_EIC_EXTINT15 << 16) | MUX_PC15A_EIC_EXTINT15)
#define PORT_PC15A_EIC_EXTINT15                    (_UINT32_(1) << 15)
#define PIN_PC15A_EIC_EXTINT_NUM                   _UINT32_(15) /* EIC signal: PIN_PC15 External Interrupt Line */

#define PIN_PC20A_EIC_NMI                          _UINT32_(84)
#define MUX_PC20A_EIC_NMI                          _UINT32_(0) 
#define PINMUX_PC20A_EIC_NMI                       ((PIN_PC20A_EIC_NMI << 16) | MUX_PC20A_EIC_NMI)
#define PORT_PC20A_EIC_NMI                         (_UINT32_(1) << 20)

/* ========== PORT definition for ETH peripheral ========== */
#define PIN_PD08K_ETH_COL                          _UINT32_(104)
#define MUX_PD08K_ETH_COL                          _UINT32_(10)
#define PINMUX_PD08K_ETH_COL                       ((PIN_PD08K_ETH_COL << 16) | MUX_PD08K_ETH_COL)
#define PORT_PD08K_ETH_COL                         (_UINT32_(1) << 8)

#define PIN_PD09K_ETH_CRS                          _UINT32_(105)
#define MUX_PD09K_ETH_CRS                          _UINT32_(10)
#define PINMUX_PD09K_ETH_CRS                       ((PIN_PD09K_ETH_CRS << 16) | MUX_PD09K_ETH_CRS)
#define PORT_PD09K_ETH_CRS                         (_UINT32_(1) << 9)

#define PIN_PD05L_ETH_GTX_CLK                      _UINT32_(101)
#define MUX_PD05L_ETH_GTX_CLK                      _UINT32_(11)
#define PINMUX_PD05L_ETH_GTX_CLK                   ((PIN_PD05L_ETH_GTX_CLK << 16) | MUX_PD05L_ETH_GTX_CLK)
#define PORT_PD05L_ETH_GTX_CLK                     (_UINT32_(1) << 5)

#define PIN_PA03K_ETH_MDC                          _UINT32_(3) 
#define MUX_PA03K_ETH_MDC                          _UINT32_(10)
#define PINMUX_PA03K_ETH_MDC                       ((PIN_PA03K_ETH_MDC << 16) | MUX_PA03K_ETH_MDC)
#define PORT_PA03K_ETH_MDC                         (_UINT32_(1) << 3)

#define PIN_PA04K_ETH_MDIO                         _UINT32_(4) 
#define MUX_PA04K_ETH_MDIO                         _UINT32_(10)
#define PINMUX_PA04K_ETH_MDIO                      ((PIN_PA04K_ETH_MDIO << 16) | MUX_PA04K_ETH_MDIO)
#define PORT_PA04K_ETH_MDIO                        (_UINT32_(1) << 4)

#define PIN_PD12K_ETH_REF_CLK                      _UINT32_(108)
#define MUX_PD12K_ETH_REF_CLK                      _UINT32_(10)
#define PINMUX_PD12K_ETH_REF_CLK                   ((PIN_PD12K_ETH_REF_CLK << 16) | MUX_PD12K_ETH_REF_CLK)
#define PORT_PD12K_ETH_REF_CLK                     (_UINT32_(1) << 12)

#define PIN_PD11K_ETH_RXD0                         _UINT32_(107)
#define MUX_PD11K_ETH_RXD0                         _UINT32_(10)
#define PINMUX_PD11K_ETH_RXD0                      ((PIN_PD11K_ETH_RXD0 << 16) | MUX_PD11K_ETH_RXD0)
#define PORT_PD11K_ETH_RXD0                        (_UINT32_(1) << 11)

#define PIN_PD10K_ETH_RXD1                         _UINT32_(106)
#define MUX_PD10K_ETH_RXD1                         _UINT32_(10)
#define PINMUX_PD10K_ETH_RXD1                      ((PIN_PD10K_ETH_RXD1 << 16) | MUX_PD10K_ETH_RXD1)
#define PORT_PD10K_ETH_RXD1                        (_UINT32_(1) << 10)

#define PIN_PD07K_ETH_RXD2                         _UINT32_(103)
#define MUX_PD07K_ETH_RXD2                         _UINT32_(10)
#define PINMUX_PD07K_ETH_RXD2                      ((PIN_PD07K_ETH_RXD2 << 16) | MUX_PD07K_ETH_RXD2)
#define PORT_PD07K_ETH_RXD2                        (_UINT32_(1) << 7)

#define PIN_PD06K_ETH_RXD3                         _UINT32_(102)
#define MUX_PD06K_ETH_RXD3                         _UINT32_(10)
#define PINMUX_PD06K_ETH_RXD3                      ((PIN_PD06K_ETH_RXD3 << 16) | MUX_PD06K_ETH_RXD3)
#define PORT_PD06K_ETH_RXD3                        (_UINT32_(1) << 6)

#define PIN_PA05K_ETH_RXDV                         _UINT32_(5) 
#define MUX_PA05K_ETH_RXDV                         _UINT32_(10)
#define PINMUX_PA05K_ETH_RXDV                      ((PIN_PA05K_ETH_RXDV << 16) | MUX_PA05K_ETH_RXDV)
#define PORT_PA05K_ETH_RXDV                        (_UINT32_(1) << 5)

#define PIN_PA06K_ETH_RXER                         _UINT32_(6) 
#define MUX_PA06K_ETH_RXER                         _UINT32_(10)
#define PINMUX_PA06K_ETH_RXER                      ((PIN_PA06K_ETH_RXER << 16) | MUX_PA06K_ETH_RXER)
#define PORT_PA06K_ETH_RXER                        (_UINT32_(1) << 6)

#define PIN_PD12L_ETH_RX_CLK                       _UINT32_(108)
#define MUX_PD12L_ETH_RX_CLK                       _UINT32_(11)
#define PINMUX_PD12L_ETH_RX_CLK                    ((PIN_PD12L_ETH_RX_CLK << 16) | MUX_PD12L_ETH_RX_CLK)
#define PORT_PD12L_ETH_RX_CLK                      (_UINT32_(1) << 12)

#define PIN_PC05K_ETH_TSUCOMP                      _UINT32_(69)
#define MUX_PC05K_ETH_TSUCOMP                      _UINT32_(10)
#define PINMUX_PC05K_ETH_TSUCOMP                   ((PIN_PC05K_ETH_TSUCOMP << 16) | MUX_PC05K_ETH_TSUCOMP)
#define PORT_PC05K_ETH_TSUCOMP                     (_UINT32_(1) << 5)

#define PIN_PC17K_ETH_TSUCOMP                      _UINT32_(81)
#define MUX_PC17K_ETH_TSUCOMP                      _UINT32_(10)
#define PINMUX_PC17K_ETH_TSUCOMP                   ((PIN_PC17K_ETH_TSUCOMP << 16) | MUX_PC17K_ETH_TSUCOMP)
#define PORT_PC17K_ETH_TSUCOMP                     (_UINT32_(1) << 17)

